tap "homebrew/bundle"
tap "sikalabs/tap"

# Formulae (top-level leaves)
brew "argocd"
brew "awscli"
brew "fzf"
brew "gh"
brew "helm"
brew "k9s"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "mas"
brew "midnight-commander"
brew "neovim"
brew "node"
brew "openjdk"
brew "openshift-cli"
brew "postgresql@18"
brew "sikalabs/tap/slu"
brew "telnet"
brew "terraform"
brew "tmux"
brew "wakeonlan"
brew "watch"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "affinity"
cask "aldente"
cask "appcleaner"
cask "balenaetcher"
cask "battle-net"
cask "bitwarden"
cask "claude"
cask "curseforge"
cask "cyberduck"
cask "dictionaries"
cask "discord"
cask "docker-desktop"
cask "fleet"
cask "chatgpt"
cask "iterm2"
cask "microsoft-edge"
cask "microsoft-onenote"
cask "onedrive"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "sdformatter"
cask "steam"
cask "tailscale-app"
cask "telegram"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "windsurf"

# Mac App Store apps
mas " 1Password for Safari ", id: 1569813296
mas " 937984704  Amphetamine           (5.3.2)", id: 937984704
mas " Clamshell            ", id: 6477896729
mas " 409183694  Keynote               (14.4)", id: 409183694
mas " 472226235  LanScan               (8.0.23)", id: 472226235
mas " Mic Drop             ", id: 1489816366
mas " 462058435  Microsoft Excel       (16.101.3)", id: 462058435
mas " 985367838  Microsoft Outlook     (16.101.3)", id: 985367838
mas " 462062816  Microsoft PowerPoint  (16.103)", id: 462062816
mas " 462054704  Microsoft Word        (16.102.2)", id: 462054704
mas " 409203825  Numbers               (14.4)", id: 409203825
mas " 409201541  Pages                 (14.4)", id: 409201541
mas " Pure Paste           ", id: 1611378436
mas " Windows App          ", id: 1295203466
