tap "homebrew/bundle"

# Formulae (top-level leaves)
brew "argocd"
brew "awscli"
brew "fzf"
brew "gh"
brew "helm"
brew "k9s"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "midnight-commander"
brew "node"
brew "openjdk"
brew "openshift-cli"
brew "telnet"
brew "wakeonlan"
brew "watch"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "aldente"
cask "appcleaner"
cask "balenaetcher"
cask "battle-net"
cask "bitwarden"
cask "chatgpt"
cask "curseforge"
cask "cyberduck"
cask "dictionaries"
cask "discord"
cask "ghostty"
cask "mic-drop"
cask "microsoft-edge"
cask "microsoft-onenote"
cask "proton-mail"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "sdformatter"
cask "steam"
cask "tailscale-app"
cask "telegram"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "warp"

